# dictionary.py
# Словарь с настройками кнопок и текстов

BOT_RESPONSES = {
    "FORBIDDEN": {"text": "🚫 Forbidden! Unauthorized user. Contact admin for help."},
    "WELCOME": {
        "text": "🏡 Param1, система Dacha Vision AI приветствует вас!\n\nСтатус: <b>На связи!</b> ✅\nВыберите действие из меню ниже 👇",
        "buttons": [
            ["📊 Актуальный статус"], 
            ["📸 Последняя активность"],
            ["📅 Сводка за 3 дня", "📡 Мониторинг"]
        ]
    },
    "MENU": {
        "text": "Выберите действие:", 
        "buttons": [
            ["📊 Актуальный статус"], 
            ["📸 Последняя активность"],
            ["📅 Сводка за 3 дня", "📡 Мониторинг"]
        ]
    },
    "MENU_WO_TEXT":{
        "buttons": [
            ["📊 Актуальный статус"], 
            ["📸 Последняя активность"],
            ["📅 Сводка за 3 дня", "📡 Мониторинг"]
        ]    
    }
}